//LABUSERH JOB 'C90A,B7101A33','BEST LAB ON EARTH',REGION=0K,
//   MSGLEVEL=(1,1),CLASS=A,MSGCLASS=H,NOTIFY=&SYSUID.
//****************************************************************/
//****************************************************************/
//HZSPRINT EXEC PGM=HZSPRNT,TIME=1440,PARMDD=SYSIN
//SYSIN DD *
CHECK(IBMPDSE,PDSE_SMSPDSE1)
//SYSOUT   DD DISP=(SHR),DSN=&SYSUID..HC.SYSOUT
//*************************************************************a***/
