//SLACK    JOB CLASS=A,NOTIFY=&SYSUID,REGION=0M,MEMLIMIT=0M,
//          MSGCLASS=A,MSGLEVEL=(1,1)
//*
//SLACK    EXEC PGM=IKJEFT01,DYNAMNBR=4,PARM='%SLACK'
//SYSUADS  DD DISP=SHR,DSN=SYS1.UADS
//SYSLBC   DD DISP=SHR,DSN=SYS1.BRODCAST
//SYSEXEC  DD DISP=SHR,DSN=hlq.SLACK.REXX
//SYSTSPRT DD SYSOUT=*
//SYSTSIN  DD DUMMY
//